&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Объект.Водитель = ПолучитьИмяВодителя();
	КонецЕсли;
	ЭтаФорма.Элементы.НезавершеннаяПоездка.ТолькоПросмотр 
		= Объект.Завершена ИЛИ ПользовательЯвляетсяПассажиром() ИЛИ НЕ ЭтоСвояПоездка();
КонецПроцедуры 
	
&НаСервере
Функция ПользовательЯвляетсяПассажиром() 
	Возврат РольДоступна("Пассажир");	
КонецФункции

&НаСервере
Функция ЭтоСвояПоездка()
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Возврат Истина;
	Иначе
		Возврат ПолучитьИмяВодителя() = Объект.Водитель;
	КонецЕсли;	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьИмяВодителя()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции

&НаКлиенте
Процедура ЗавершитьПоездку(Команда) 
	Объект.Завершена = Истина;  
	ОценитьВодителя();
	ОценитьПассажиров(); 
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры   	
	
&НаСервере
Процедура ОценитьВодителя()  
	Для каждого ТекПассажир из Объект.Пассажиры Цикл    
		ОценкаВодителю = Документы.ОценкаВодителя.СоздатьДокумент();  
		ОценкаВодителю.Дата = ТекущаяДата();   
		ОценкаВодителю.Водитель = Объект.Водитель;
		ОценкаВодителю.Пассажир = ТекПассажир.Пассажир;    
		ОценкаВодителю.Поездка = Объект.Ссылка;
		ОценкаВодителю.Записать();	
	КонецЦикла;
КонецПроцедуры           

Процедура ОценитьПассажиров() 
	Для каждого ТекПассажир из Объект.Пассажиры Цикл    
		ОценкаПассажиру = Документы.ОценкаПассажира.СоздатьДокумент();  
		ОценкаПассажиру.Дата = ТекущаяДата();   
		ОценкаПассажиру.Водитель = Объект.Водитель;
		ОценкаПассажиру.Пассажир = ТекПассажир.Пассажир;    
		ОценкаПассажиру.Поездка = Объект.Ссылка;
		ОценкаПассажиру.Записать();	
	КонецЦикла;
КонецПроцедуры

