 
Процедура ОбработкаПроведения(Отказ, Режим)
	Пассажир = ЭтотОбъект.Пассажир;	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ОценкаПассажира.Оценка КАК Оценка
    |ИЗ
    |   Документ.ОценкаПассажира КАК ОценкаПассажира
    |ГДЕ
    |   ОценкаПассажира.Пассажир = &Пассажир";
    Запрос.УстановитьПараметр("Пассажир", Пассажир);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
	
    СуммаОценок = 0;
    КоличествоОценок = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Оценка.Наименование <> "" Тогда
		   СуммаОценок = СуммаОценок + Число(Выборка.Оценка.Наименование);
		   КоличествоОценок = КоличествоОценок + 1;    
	   	КонецЕсли;        
    КонецЦикла;
    Если КоличествоОценок > 0 Тогда
        Рейтинг = СуммаОценок / КоличествоОценок;
    Иначе
        Рейтинг = 0;
    КонецЕсли;
	
	Движения.РейтингПассажиров.Записывать = Истина;
	Движение = Движения.РейтингПассажиров.Добавить();
	Движение.Пассажир = Пассажир;
    Движение.Рейтинг = Рейтинг;
	Движение.Период = ТекущаяДата();
КонецПроцедуры
    

