 
Процедура ОбработкаПроведения(Отказ, Режим)
	Водитель = ЭтотОбъект.Водитель;	
	Запрос = Новый Запрос;  
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ОценкаВодителя.Оценка КАК Оценка
    |ИЗ
    |   Документ.ОценкаВодителя КАК ОценкаВодителя
    |ГДЕ
    |   ОценкаВодителя.Водитель = &Водитель";
    Запрос.УстановитьПараметр("Водитель", Водитель);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
	
    СуммаОценок = 0;
    КоличествоОценок = 0;
	Пока Выборка.Следующий() Цикл      
		Если Выборка.Оценка.Наименование <> "" Тогда
		   СуммаОценок = СуммаОценок + Число(Выборка.Оценка.Наименование);
		   КоличествоОценок = КоличествоОценок + 1;    
	   	КонецЕсли;
    КонецЦикла;
    Если КоличествоОценок > 0 Тогда
        Рейтинг = СуммаОценок / КоличествоОценок;
    Иначе
        Рейтинг = 0;
    КонецЕсли;

	Движения.РейтингВодителей.Записывать = Истина;
	Движение = Движения.РейтингВодителей.Добавить();
	Движение.Водитель = Водитель;
	Движение.Рейтинг = Число(Рейтинг);
	Движение.Период = ТекущаяДата();
КонецПроцедуры
    

